oldtsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="54.86.200.146" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="35" unit="second">
     <users arrivalrate="2" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="User login and buy product" probability="80" type="ts_http">
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is looking at products -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a random number to represent username -->
      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username" />
      </setdynvars>

      <!-- visit the login page -->
      <request>
        <http url="/buyers/sign_in" version="1.1" method="GET"></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out login information -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Perform login -->
      <request subst="true">
        <http
          url='/buyers/sign_in'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;buyer%5Bemail%5D=%%_username%%%401.com&amp;buyer%5Bpassword%5D=12345678&amp;buyer%5Bremember_me%5D=0&amp;commit=Log+in'>
        </http>
      </request>

      <!-- wait for up to 2 seconds, user is deciding which product to buy -->
      <thinktime value="2" random="true"></thinktime>
      
      <!-- View a product -->
      <setdynvars sourcetype="random_number" start="1" end="4327">
        <var name="random_product1" />
      </setdynvars>
      <request subst="true">
        <http url='/products/%%_random_product1%%' version='1.1' method='GET'></http>
      </request>
      
      <!-- wait for up to 2 seconds, user is looking at products -->
      <thinktime value="2" random="true"></thinktime>
      
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- pick a product randomly -->
      <setdynvars sourcetype="random_number" start="1" end="4327">
        <var name="random_product" />
      </setdynvars>

      <!-- Add product to cart -->
      <request subst="true">
        <http
          url='/line_items?line_item%5Bproduct_id%5D=%%_random_product%%&amp;line_item%5Bquantity%5D=1'
          version='1.1'
          method='POST'
          contents='line_item%5Bproduct_id%5D=%%_random_product%%&amp;line_item%5Bquantity%5D=1'>
        </http>
      </request>

      <!-- wait for up to 2 seconds, user decides to checkout -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Checkout action -->
      <request>
        <http url='/orders/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 10 seconds, user is filling out the delivery information -->
      <thinktime value="3" random="true"></thinktime>

      <!-- Place order -->
      <request subst="true">
        <http
          url='/orders'
          version='1.1'
          method='POST'
          contents='order%5Bname%5D=Joe+Gaucho&amp;order%5Baddress%5D=Santa+Barbara+CA+93106&amp;order%5Bemail%5D=a%40a.com&amp;order%5Bpay_type%5D=Check&amp;commit=Place+Order'>
        </http>
      </request>
    </session>



    <session name="Seller create products" probability="10" type="ts_http">
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- visit the login page -->
      <request>
        <http url="/sellers/sign_in" version="1.1" method="GET"></http>
      </request>
      
      <!-- create a random number to represent username -->
      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="20">
        <var name="provider" />
      </setdynvars>

      <!-- wait for up to 2 seconds, user is filling out login information -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Perform login -->
      <request subst="true">
        <http
          url='/sellers/sign_in'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;seller%5Bemail%5D=%%_username%%%40%%_provider%%.com&amp;seller%5Bpassword%5D=12345678&amp;seller%5Bremember_me%5D=0&amp;commit=Log+in'>
        </http>
      </request>

      <!-- visit the products page -->
      <request>
        <http url="/products" version="1.1" method="GET"></http>
      </request>
      
       <!-- wait for up to 2 seconds, browse products -->
      <thinktime value="2" random="true"></thinktime>
      
      <!-- Now create product -->
      <request>
          <http url="/products/new" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="random_string" length="5">
          <var name="prod_name" />
      </setdynvars>
      <setdynvars sourcetype="random_string" length="15">
          <var name="prod_desc" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="100" end="1000">
        <var name="price" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="quantity" />
      </setdynvars>

      <request subst="true">
        <http
          url='/products'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;product%5Btitle%5D=%%_prod_name%%&amp;product%5Bdescription%5D=%%_prod_desc%%&amp;product%5Bimage_url%5D=a.jpg&amp;product%5Bprice%5D=%%_price%%&amp;product%5Bquantity%5D=%%_quantity%%&amp;commit=Create+Product'>
        </http>
      </request>
      
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
    </session>
    
    
    <session name="Seller put on sale products" probability="10" type="ts_http">
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- visit the login page -->
      <request>
        <http url="/sellers/sign_in" version="1.1" method="GET"></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out login information -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Perform login -->
      <request subst="true">
        <http
          url='/sellers/sign_in'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;seller%5Bemail%5D=seller%40g.com&amp;seller%5Bpassword%5D=12345678&amp;seller%5Bremember_me%5D=0&amp;commit=Log+in'>
        </http>
      </request>
      
      <!-- visit the products page -->
      <request>
        <http url="/products" version="1.1" method="GET"></http>
      </request>

      <!-- Now create product -->
      <request>
          <http url="/products/new" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="random_string" length="5">
          <var name="prod_name" />
      </setdynvars>
      <setdynvars sourcetype="random_string" length="15">
          <var name="prod_desc" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="100" end="1000">
        <var name="price" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="quantity" />
      </setdynvars>

      <request subst="true">
        <http
          url='/products'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;product%5Btitle%5D=%%_prod_name%%&amp;product%5Bdescription%5D=%%_prod_desc%%&amp;product%5Bimage_url%5D=a.jpg&amp;product%5Bprice%5D=%%_price%%&amp;product%5Bquantity%5D=%%_quantity%%&amp;commit=Create+Product'>
        </http>
      </request>

      <!-- Put a product on sale -->
      <!-- visit the products page -->
      <request>
        <http url="/products" version="1.1" method="GET"></http>
      </request>

      <!-- pick a product randomly -->
      <setdynvars sourcetype="random_number" start="1" end="1999">
        <var name="random_sale" />
      </setdynvars>

      <!-- Create sale -->
      <request subst="true">
        <http
            url='/sale_products'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;sale_product%5Bproduct_id%5D=%%_random_sale%%&amp;sale_product%5Bprice%5D=100&amp;sale_product%5Bquantity%5D=1&amp;sale_product%5Bstarted_at%281i%29%5D=2015&amp;sale_product%5Bstarted_at%282i%29%5D=11&amp;sale_product%5Bstarted_at%283i%29%5D=6&amp;sale_product%5Bstarted_at%284i%29%5D=01&amp;sale_product%5Bstarted_at%285i%29%5D=09&amp;sale_product%5Bexpired_at%281i%29%5D=2015&amp;sale_product%5Bexpired_at%282i%29%5D=11&amp;sale_product%5Bexpired_at%283i%29%5D=6&amp;sale_product%5Bexpired_at%284i%29%5D=01&amp;sale_product%5Bexpired_at%285i%29%5D=10&amp;commit=Create+Sale+product'>
        </http>
      </request>
      
      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
    </session>
  </sessions>
</tsung>